#+TITLE: Notebook


#+begin_src ipython :session
%load_ext autoreload
%autoreload 2
#+end_src

#+RESULTS:
: # Out[1]:

#+begin_src ipython :session
import generated.notification.protocol_pb2 as proto
#+end_src

#+RESULTS:
: # Out[2]:

#+begin_src ipython :session
from kafka import KafkaProducer

topic = "crawler-requests"

producer = KafkaProducer(bootstrap_servers="localhost:9092")
#+end_src

#+RESULTS:
: # Out[3]:


#+begin_src ipython :session
request = proto.Request()
request.crawl.requestId = "1234"
# request.crawl.url = "https://duckduckgo.com/html?q=test%20!g"
# request.crawl.url = "https://allegro.pl/oferta/hantle-30kg-2x15kg-2x-hantla-zestaw-hantli-2x-gryf-9761358403?bi_s=ads&bi_m=listing%3Adesktop%3Acategory&bi_c=MmZmMmI5YjAtYWI4MS00NjEzLTlmODQtY2VmMmE0NDJlMzRhAA&bi_t=ape&referrer=proxy&emission_unit_id=9e0f322b-f88a-412d-8390-fa2ea74c0aae#aboutSeller"
request.crawl.url = "https://aproszewska.com/"
# request.crawl.url = "https://apdafadsfadfroszewska.com/"
request.crawl.jobId = "1234"
request.crawl.query.keywords.append("test")
request.crawl.query.operator = proto.Query.Operator.OR

producer.send(topic, request.SerializeToString()).get(timeout=60)
#+end_src

#+RESULTS:
: # Out[82]:
: : RecordMetadata(topic='crawler-requests', partition=1, topic_partition=TopicPartition(topic='crawler-requests', partition=1), offset=31, timestamp=1606617444426, checksum=2746659376, serialized_key_size=-1, serialized_value_size=50, serialized_header_size=-1)
